title: Malicious HTML Application #Title of your rule
id: 687e335e-8111-4521-a524-ebb139e18354 #Universally Unique Identifier (UUID) Generate one from https://www.uuidgenerator.net
status: test #stage of your rule testing 
description: Detects the usage of Malicious HTML Application #Details about the detection intensions of the rule.
author: Bhagavan Bollina #Who wrote the rule.
date: #When was the rule written.
modified: #When was it updated
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    ParentImage: 'C:\Program Files\Google\Chrome\Application\chrome.exe' #Search identifiers for the detection. Refer to the required fields provided in the task. 
    Image: 'C:\Windows\SysWOW64\mshta.exe'
  condition: selection #Action to be taken. Can use condition operators such as OR, AND, NOT, 
fields: #List of associated fields that are important for the detection

falsepositives: #Any possible false positives that could trigger the rule.

level: medium #Severity level of the detection rule.
tags: #Associated TTPs from MITRE ATT&CK
  - attack.credential_access #MITRE Tactic
  - attack.t1110 #MITRE Technique
references: #Any references to the detection rule.
  - https://www.microsoft.com/security/blog/2023/08/01/microsoft-detects-new-malware-campaigns-using-mshta-to-deliver-malicious-html-applications/
  - https://www.bleepingcomputer.com/news/security/new-malicious-html-applications-used-to-deliver-malware/
  - https://www.cybereason.com/blog/mshta-malicious-html-applications
  - https://www.cybereason.com/blog/mshta-malicious-html-applications-part-2
