title: Malicious HTML Application #Title of your rule
id: 687e335e-8111-4521-a524-ebb139e18354 #Universally Unique Identifier (UUID) Generate one from https://www.uuidgenerator.net
status: test #stage of your rule testing 
description: Detects the usage of Malicious HTML Application #Details about the detection intensions of the rule.
author: Bhagavan Bollina #Who wrote the rule.
date: #When was the rule written.
modified: #When was it updated
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    Parent Image: chrome.exe #Search identifiers for the detection. Refer to the required fields provided in the task. 
    Image: mshta.exe
    Command Line: 'C:\Windows\SysWOW64\mshta.exe C:\Users\victim\Downloads\update.hta'
  condition: selection #Action to be taken. Can use condition operators such as OR, AND, NOT, 
fields: #List of associated fields that are important for the detection

falsepositives: #Any possible false positives that could trigger the rule.

level: medium #Severity level of the detection rule.
tags: #Associated TTPs from MITRE ATT&CK
  - attack.credential_access #MITRE Tactic
  - attack.t1110 #MITRE Technique
