title: Finding the Netcat Reverse Shell Access
id: 83be679f-9be7-44ef-bf28-2de90c3e416f
status: test
description: Detect the usage of certutil binary
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection1:
    Image|endswith: 'nc.exe'
    CommandLine|contains|all:
      - 'nc.exe'
      - ' -e cmd.exe'
    EventID: '1'
  selection2:
    Hashes|contains:
      - '523613A7B9DFA398CBD5EBD2DD0F4F38'
  condition: selection1 or selection2
fields:
  - CommandLine
  - Image
  - Hashes
  - ParentImage
  - User
falsepositives:
  - Rare legitimate use of Netcat
level: medium
tags:
  - attack.credential_access
  - attack.t1110
