title: PowerUp Detection
id: 6f583ee6-4b62-4e16-bfd6-76ef1ad2a72e
status: test
description: Detects the usage of privilege escalation tool PowerUp
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    Image|endswith: 'powershell.exe'
    CommandLine|contains|all:
      - 'PowerUp.ps1'
      - 'Invoke-AllChecks'
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate pentest or red team simulation activity
level: medium
tags:
  - attack.privilege_escalation
  - attack.t1087
