title: Detecting Service Binary Abuse
id: adce05d5-187d-4055-9ce6-5405e95c5602
status: test
description: Detecting the service binary privilege escalations
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    Image|endswith: 'sc.exe'
    CommandLine|contains|all:
      - 'sc.exe'
      - ' config '
      - ' binPath= '
      - ' -e '
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate administrator service configuration tasks
level: medium
tags:
  - attack.privilege_escalation
  - attack.t1543.003
