title: Find the Persistent Threat
id: 0c050096-a953-4c3e-8f49-23561274032c
status: test
description: Detection of RunOnce persistence technique
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    Image|endswith: 'reg.exe'
    CommandLine|contains|all:
      - 'RunOnce'
      - 'REG_SZ'
      - ' add '
      - ' /v '
      - ' /t '
      - ' /d '
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate software installers using RunOnce keys
level: medium
tags:
  - attack.persistence
  - attack.t1547.001
