title: Detect the Data Binding or Compressing
id: f9d0c138-978f-417f-a761-a8b13bd416a6
status: test
description: Detecting the 7-Zip suspicious archiving activity, including password-protected archive creation often used for data exfiltration or staging.
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    Image|endswith: '7z.exe'
    CommandLine|contains:
      - ' a '
      - ' -p '
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
  - CurrentDirectory
falsepositives:
  - Internal users using 7-Zip to password-protect legitimate archives
level: medium
tags:
  - attack.credential_access
  - attack.t1110
  - attack.t1560.001  # Archive collected data: Archive via Utility
references:
  - https://attack.mitre.org/techniques/T1560/001/
  - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
