title: Detecting the cURL Exfiltration
id: 29d3d4c1-4c55-4d4c-96d1-4e2307d6c622
status: test
description: Detecting the data exfiltration using cURL
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 1
    Image|endswith: 'curl.exe'
    CommandLine|contains:
      - ' -d '
  condition: selection
fields:
  - CommandLine
  - Image
  - ParentImage
  - User
falsepositives:
  - Legitimate use of curl to interact with internal APIs or automation scripts
level: medium
tags:
  - attack.exfiltration
  - attack.t1041
