title: Detecting the Ransomware File Encryption
id: 6221f004-7102-437a-8cbc-6b044c496db5
status: test
description: Detects ransomware activity by identifying files being written with the ".huntme" extension
author: Bhagavan Bollina
date: 2025-06-01
modified: 2025-06-01
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 11
    TargetFilename|endswith: '.huntme'
  condition: selection
fields:
  - TargetFilename
  - Image
  - User
  - ProcessId
falsepositives:
  - Unlikely unless intentionally testing ransomware in lab environments
level: medium
tags:
  - attack.impact
  - attack.t1486
