title: Finding the Netcat Reverse shell access #Title of your rule
id: b714724d-ed5b-4718-99b6-7ff27572aac6 #Universally Unique Identifier (UUID) Generate one from https://www.uuidgenerator.net
status: test #stage of your rule testing 
description: Detect the usage of certutil binary #Details about the detection intensions of the rule.
author: Bhagavan Bollina #Who wrote the rule.
date: #When was the rule written.
modified: #When was it updated
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    FieldName1: Value #Search identifiers for the detection. Refer to the required fields provided in the task. 
    FieldName2: Value
  condition: selection #Action to be taken. Can use condition operators such as OR, AND, NOT, 
fields: #List of associated fields that are important for the detection

falsepositives: #Any possible false positives that could trigger the rule.

level: medium #Severity level of the detection rule.
tags: #Associated TTPs from MITRE ATT&CK
  - attack.credential_access #MITRE Tactic
  - attack.t1110 #MITRE Technique
